//console.log('========== Цикл while ================');

//todo  Цикл з передумовою — цикл, який виконується, доки правдива якась умова, зазначена до його початку. 
//todo  Ця умова перевіряється до виконання тіла циклу, тому тіло може не виконатися жодного разу, якщо умова від самого початку - хибна 

// let counter = 8;

// while (counter < 10) {
//   console.log("counter: ", counter);
//   counter += 1;
// }

//==============================================================

// let clientCounter = 21;
// const maxClients = 25;

// while (clientCounter < maxClients) {
//   console.log(clientCounter);
//   clientCounter += 1;
// }

console.log('========== Цикл do...while ================');

//todo  Цикл з постумовою - цикл, в якому умова перевіряється після виконання тіла циклу.
//todo  З цього випливає, що тіло завжди виконується хоча б один раз.

let password = "";

// do {
//   password = prompt("Введіть пароль довший 4-х символів", "");
// } while (password.length < 5);

// console.log("Ввели пароль: ", password);


console.log('========== Цикл for ================');


//todo Цикл з лічильником - цикл, в якому певна змінна змінює своє значення із заданого початкового до кінцевого значення з деяким кроком, і для кожного значення цієї змінної тіло циклу виконується один раз.


//console.log("У прикладі оголошується змінна-лічильник i, ініціалізується значенням 0 і цикл виконується доти, доки i <= 20, тобто умова приводиться до true. Після кожної ітерації лічильник збільшується на 5.?\"")
// for (let i = 0; i <= 20; i += 5) {
//   console.log(i);
// }


//console.log("Порахуємо суму чисел до певного значення.");
// const target = 45;
// let sum = 0;
// for (let i = 0; i <= target; i += 1) {
//   sum += i;
// }
// console.log(sum);


// console.log("Згадаємо про операцію a % b і виведемо остачу від ділення за допомогою циклу.");
const max = 10;
for (let i = 0; i < max; i += 1) {
  console.log(`${max} % ${i} = `, max % i);
}

// console.log("========== Оператор break ========== ");
// for (let i = 0; i <= 5; i += 1) {
//   console.log(i);

//   if (i === 3) {
//     console.log("Знайшли число 3, перериваємо виконання циклу");
//     break;
//   }
// }
// console.log("Лог після циклу");

console.log("========== Оператор continue ========== ");

// const number = 10;

// for (let i = 0; i < number; i += 1) {
//   if (i % 2 === 0) {
//     continue;
//   }

//   console.log("Непарне i: ", i); // 1, 3, 5, 7, 9
// }